In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib widget

In [2]:
cf=pd.read_csv("gender_submission.csv")

In [3]:
d=cf.isnull()

In [4]:
for i in d.columns.values.tolist():
    print(d[i].value_counts())

False    418
Name: PassengerId, dtype: int64
False    418
Name: Survived, dtype: int64

In [5]:
df=pd.read_csv("train.csv")

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df.fillna(np.nan,inplace=True)

In [8]:
df.drop(["Cabin"],axis=1,inplace=True)

In [9]:
avgma=df[df["Sex"]=="male"].Age.mean()

In [10]:
avgwa=df[df["Sex"]=="female"].Age.mean()

In [11]:
s=[]
for i in df.index.tolist():
    temp=df.loc[i]
    if str(temp.Age)=="nan":
        
        if temp.Sex=="male":
            s.append(avgma)
        else:
            s.append(avgwa)
    
    else:
        s.append((temp.Age))

df.drop(["Age"],inplace=True,axis=1)
df["Age"]=pd.Series(s)
pf=pd.merge(df,cf,on="PassengerId")

In [12]:
df.fillna(method="ffill",inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Embarked     891 non-null    object
 10  Age          891 non-null    float64
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Embarked,Age
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,S,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,S,35.0

In [14]:
plt.figure()
plt.hist(df["Age"])

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous â€¦

(array([ 54.,  46., 177., 346., 118.,  70.,  45.,  24.,   9.,   2.]),
 array([ 0.42 ,  8.378, 16.336, 24.294, 32.252, 40.21 , 48.168, 56.126,
        64.084, 72.042, 80.   ]),
 <a list of 10 Patch objects>)

In [22]:
pd.pivot_table(df,index="Survived",values=["Parch","SibSp","Fare","Age","Pclass"])

                Age       Fare     Parch    Pclass     SibSp
Survived
0         30.562012  22.117887  0.329690  2.531876  0.553734
1         28.410122  48.395408  0.464912  1.950292  0.473684

In [30]:

df.plot("Age","Fare",c="Parch",s=df["Pclass"],kind="scatter",cmap="Spectral");

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous â€¦

In [25]:
plt.figure()
sns.heatmap(df.corr())

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous â€¦

In [45]:
pd.pivot_table(df,index="Survived",columns="Pclass",aggfunc="count",values="Ticket")

Pclass      1   2    3
Survived
0          80  97  372
1         136  87  119

In [51]:
pd.pivot_table(df,index="Survived",columns="Sex",aggfunc="count",values="Ticket")

Sex       female  male
Survived
0             81   468
1            233   109

In [52]:
pd.pivot_table(df,index="Survived",columns="Embarked",aggfunc="count",values="Ticket")

Embarked   C   Q    S
Survived
0         75  47  427
1         94  31  217

In [64]:
plt.figure()
plt.bar(df["Embarked"].value_counts().index.tolist(),df["Embarked"].value_counts().values.tolist())

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous â€¦

In [62]:
df["Embarked"].value_counts().values.tolist()

[644, 169, 78]